def main():
    # Введення координат точки А з клавіатури
    x = float(input("Введіть координату x точки A: "))
    y = float(input("Введіть координату y точки A: "))

    # Визначення розташування точки на площині
    if x == 0 and y == 0:
        print("Точка A знаходиться в початку координат.")
    elif x == 0:
        print("Точка A знаходиться на вісі ОY.")
    elif y == 0:
        print("Точка A знаходиться на вісі ОX.")
    elif x > 0 and y > 0:
        print("Точка A знаходиться в першому координатному куті.")
    elif x < 0 and y > 0:
        print("Точка A знаходиться в другому координатному куті.")
    elif x < 0 and y < 0:
        print("Точка A знаходиться в третьому координатному куті.")
    else:
        print("Точка A знаходиться в четвертому координатному куті.")

if __name__ == "__main__":
    main()
