def main():
    # Введення цілих чисел a та b з клавіатури
    a = int(input("Введіть ціле число a: "))
    b = int(input("Введіть ціле число b: "))

    # Перевірка на рівність чисел
    if a != b:
        # Якщо числа не рівні, замінити кожне з них більшим з них
        if a > b:
            b = a
        else:
            a = b
    else:
        # Якщо числа рівні, замінити їх обидва на нулі
        a = b = 0

    # Виведення результату
    print("a:", a)
    print("b:", b)

if __name__ == "__main__":
    main()
