import math

def distance_to_origin(x, y):
    # Функція для обчислення відстані від точки (x, y) до початку координат
    return math.sqrt(x**2 + y**2)

def main():
    # Введення координат точок А і В з клавіатури
    x1 = float(input("Введіть координату x1 точки A: "))
    y1 = float(input("Введіть координату y1 точки A: "))
    x2 = float(input("Введіть координату x2 точки B: "))
    y2 = float(input("Введіть координату y2 точки B: "))

    # Обчислення відстаней від кожної точки до початку координат
    distance_A = distance_to_origin(x1, y1)
    distance_B = distance_to_origin(x2, y2)

    # Порівняння відстаней і визначення, яка точка знаходиться ближче до початку координат
    if distance_A < distance_B:
        print("Точка A знаходиться ближче до початку координат.")
    elif distance_A > distance_B:
        print("Точка B знаходиться ближче до початку координат.")
    else:
        print("Точки А і В знаходяться на однаковій відстані до початку координат.")

if __name__ == "__main__":
    main()
